; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v6)
		(pred_2 ?v8)
		(pred_1 ?v3)
		(pred_4 ?v3)
		(pred_6 ?v8 ?v3)
		(pred_3)
		(pred_5 ?v8))

   (:action op_1
       :parameters  (?v4 ?v2)
       :precondition (and (not-eq ?v4 ?v2) 
                          (pred_1 ?v4) (pred_1 ?v2) (pred_4 ?v4))
       :effect (and  (pred_4 ?v2)
		     (not (pred_4 ?v4))))


   (:action op_2
       :parameters (?v5 ?v1)
       :precondition  (and  (pred_2 ?v5) (pred_1 ?v1)
			    (pred_6 ?v5 ?v1) (pred_4 ?v1) (pred_3))
       :effect (and (pred_5 ?v5)
		    (not (pred_6 ?v5 ?v1)) 
		    (not (pred_3))))

   (:action op_3
       :parameters  (?v5  ?v1)
       :precondition  (and  (pred_2 ?v5) (pred_1 ?v1)
			    (pred_5 ?v5) (pred_4 ?v1))
       :effect (and (pred_6 ?v5 ?v1)
		    (pred_3)
		    (not (pred_5 ?v5)))))

; problem
(define (problem ferry-l5-c3)
(:domain ferry)
(:objects obj_05 obj_06 obj_02 obj_03 obj_08 
          obj_01 obj_04 obj_07 
)
(:init
(pred_1 obj_05)
(pred_1 obj_06)
(pred_1 obj_02)
(pred_1 obj_03)
(pred_1 obj_08)
(pred_2 obj_01)
(pred_2 obj_04)
(pred_2 obj_07)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_08)
(not-eq obj_08 obj_06)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_08)
(not-eq obj_08 obj_02)
(not-eq obj_03 obj_08)
(not-eq obj_08 obj_03)
(pred_3)
(pred_6 obj_01 obj_02)
(pred_6 obj_04 obj_02)
(pred_6 obj_07 obj_02)
(pred_4 obj_05)
)
(:goal
(and
(pred_6 obj_01 obj_08)
(pred_6 obj_04 obj_06)
(pred_6 obj_07 obj_08)
)
)

(:constraints
  (and
    (sometime-before  (pred_6 obj_01 obj_08) (pred_4 obj_06))
    (sometime-before  (pred_6 obj_04 obj_06) (pred_4 obj_03))
    (sometime-before  (pred_6 obj_07 obj_08) (pred_4 obj_06))
  )
)
)

; plan
1. (op_1 obj_05 obj_02)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_02)
   goals met: 0 of 3
2. (op_2 obj_07 obj_02)
   deleted: (pred_6 obj_07 obj_02) (pred_3)
   added: (pred_5 obj_07)
   goals met: 0 of 3
3. (op_1 obj_02 obj_03)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_03)
   goals met: 0 of 3
4. (op_3 obj_07 obj_03)
   deleted: (pred_5 obj_07)
   added: (pred_6 obj_07 obj_03) (pred_3)
   goals met: 0 of 3
5. (op_1 obj_03 obj_02)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_02)
   goals met: 0 of 3
6. (op_2 obj_04 obj_02)
   deleted: (pred_6 obj_04 obj_02) (pred_3)
   added: (pred_5 obj_04)
   goals met: 0 of 3
7. (op_1 obj_02 obj_06)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_06)
   goals met: 0 of 3
8. (op_3 obj_04 obj_06)
   deleted: (pred_5 obj_04)
   added: (pred_6 obj_04 obj_06) (pred_3)
   goals met: 1 of 3
9. (op_1 obj_06 obj_02)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_02)
   goals met: 1 of 3
10. (op_2 obj_01 obj_02)
   deleted: (pred_6 obj_01 obj_02) (pred_3)
   added: (pred_5 obj_01)
   goals met: 1 of 3
11. (op_1 obj_02 obj_08)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_08)
   goals met: 1 of 3
12. (op_3 obj_01 obj_08)
   deleted: (pred_5 obj_01)
   added: (pred_6 obj_01 obj_08) (pred_3)
   goals met: 2 of 3
13. (op_1 obj_08 obj_03)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_03)
   goals met: 2 of 3
14. (op_2 obj_07 obj_03)
   deleted: (pred_6 obj_07 obj_03) (pred_3)
   added: (pred_5 obj_07)
   goals met: 2 of 3
15. (op_1 obj_03 obj_08)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_08)
   goals met: 2 of 3
16. (op_3 obj_07 obj_08)
   deleted: (pred_5 obj_07)
   added: (pred_6 obj_07 obj_08) (pred_3)
   goals met: 3 of 3
